#!/usr/bin/env python
# -*- coding: utf-8 -*-

__ENV__  =  'python3';
__author =  'hanss401';

import numpy as np;
import pickle;

# ({'ADJ___144':'NN___17','ADV___100':'ADJ___144','PR___44':'NN___17'},{'ADJ___121':'NN___152','ADV___101':['NN___174','NN___152']})

# 
EXPIRIENCE_DICT_PAIR = [({'优质的':'橡胶', '年前':'优质的'},{'现在':'看涨', '看涨':['机构', '橡胶']}),
                        ({'看涨':['机构', '橡胶']},{'做多':['散户', '橡胶'], '不久后':'做多'}),
                        ({'下跌':'白糖', '现在':'下跌'},{'增产的':'菜粕', '年后':'增产的'}),
                        ({'减产的':'菜粕', '不久前':'减产的'},{'不久后':'做多', '做多':['庄家', '豆油']}),
                        ({'年前':'下跌', '下跌':'大豆', '稍微':'下跌'},{'现在':'做空', '做空':['机构', '豆油']}),
                        ({'上涨':'棉花', '现在':'上涨'},{'不久前':'供不应求', '供不应求':'棉花'}),
                        ({'下跌':'甲醇', '不久前':'下跌'},{'不久后':'下跌', '下跌':'PTA'}),
                        ({'优质的':'玉米', '现在':'优质的'},{'优质的':'鸡蛋', '年后':'优质的'}),
                        ({'优质的':'铁矿石', '现在':'优质的'},{'年后':'优质的', '优质的':'热卷'}),
                        ({'减产的':'铁矿石', '现在':'减产的'},{'减产的':'螺纹', '不久后':'减产的'}),
                        ({'下跌':'沥青', '严重':'下跌'},{'上涨':'白银', '稍微':'上涨'}),
                        ({'上涨':'白银', '稍微':'上涨'},{'下跌':'黄金', '稍微':'下跌'}),
                        ({'上涨':'苹果', '年前':'上涨'},{'稍微':'增产的', '增产的':'苹果'}),
                        ({'现在':'供大于求', '供大于求':'焦炭'},{'严重':'减产的', '减产的':'铝'}),
                        ({'不久前':'劣质的', '劣质的':'甲醇'},{'不久后':'做多', '做多':['散户', '甲醇']}),
                        ({'现在':'优质的', '优质的':'PTA'},{'现在':'做空', '做空':['庄家', 'PTA']}),
                        ({'严重':'减产的', '减产的':'沥青'},{'年前':'看跌', '看跌':['机构', '沥青']}),
                        ({'年前':'供大于求', '供大于求':'铜'},{'年后':'看涨', '看涨':['庄家', '铜']})
                        ];

VALUABLE_EVENTS_DICT = {};

NEWS_EVENTS_DICT = [{'上涨':'苹果', '年前':'上涨'},
                    {'优质的':'铁矿石', '不久前':'优质的'},
                    {'严重':'减产的', '减产的':'鸡蛋'},
                    {'看涨':['庄家', '铜']},
                    {'看涨':['庄家', '甲醇']},
                    {'做多':['散户', 'PTA']},
                    {'做空':['庄家', '螺纹']},
                    {'看跌':['机构', '热卷']},
                    {'看涨':['机构', '沥青']}
                    ];

def make_random_vec(LOW = -5.0,HIGH = 5.0,DIM = 4):
    return np.random.rand(DIM)*(HIGH - LOW) + LOW;

def make_words_vecs():
    for WORD_PROPERTY in ['ADJ','ADV','NN','PR']:
        with open(WORD_PROPERTY+'.dst','r') as FILE_STREAM:
            WORDs = FILE_STREAM.readlines();
            VECs  = [];
            for i in range(len(WORDs)):
                VECs.append( make_random_vec() );
            np.save( WORD_PROPERTY,np.array(VECs) );

if __name__ == '__main__':
    make_words_vecs();    